{
  "snake1": {
    "commonName": "Timber Rattlesnake",
    "scientificName": "crotalus horridus",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/timberRattler.png",
    "venomous": true,
    "diet": "small mammals, birds, frogs, snakes",
    "size": "36-60 in, 1.1-3.3 lbs",    
    "conservationStatus": "low concern",
    "description": "Timber rattlesnakes, which are called canebrake rattlesnake in the Coastal Plain of the Southeast, are large, heavy bodied snakes with the characteristic rattles on the end of the tail. Canebrakes are usually gray and may even have a pink hue and a pinkish, yellow, orange, or brown stripe running the length of the back. Timber rattlers are typically more brown or yellowish and may even be black. Both forms have solid black tails that appear almost velvet and black chevrons on the back and sides with the point of the (V) pointing forward. The babies are miniatures of the adults but are usually a lighter gray and have only a single button (rattle) on the tip of the tail at birth. Males get larger than females.",    
    "headShape": "arrow",
    "bodyShape": "stocky",    
    "tailShape": "rattle",
    "baseColor": "brown, grey",
    "markings": true,    
    "markColor": "brown, black",
    "markShape": "chevron, saddles",
    "scaleTexture": "rough",
    "secondaryColor": "tan"
  },
  "snake2": {
    "commonName": "Black Pine Snake",
    "scientificName": "Pituophis melanoleucus lodingi",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/blackPineSnake.jpg",
    "venomous": false,
    "diet": "rats, mice, moles, and other small mammals, eggs",
    "size": "74 in, 4-8 lbs",    
    "conservationStatus": "threatened",
    "description": "When scared they’ll make a loud hissing noise and quickly vibrate the end of their tail against the ground. The shaking of the tail, especially in dry vegetation, often sounds like a rattlesnake. They spend the majority of their time hanging out underground in root channels of rotting pine stumps where it’s dark and cozy. They are found in the United States from south-western Alabama to eastern Louisiana.",    
    "headShape": "round",
    "bodyShape": "medium",    
    "tailShape": "short",
    "baseColor": "brown, black",
    "markings": false,    
    "markColor": "",
    "markShape": "",
    "scaleTexture": "smooth",
    "secondaryColor": "none"
  },
  "snake3": {
    "commonName": "Black Racer",
    "scientificName": "Coluber constrictor",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/blackRacer.jpg",
    "venomous": false,
    "diet": "rodents, birds, lizards, other snakes, frogs, toads, insects",
    "size": "36-60 in, 1.25 lbs",    
    "conservationStatus": "low concern",
    "description": "Black racers are, as the name implies, solid deep black in color on their upper side. Their bellies vary from dark gray to black, and some white frequently occurs on the chin and throat. Their eyes are brown, and their scales are smooth. Young snakes are tan or grayish in color with a series of brown or reddish blotches running down the center of the back.  The color pattern present in juveniles fades to black as they grow older. Black racers are an alert and very active species. They are quick to flee when approached, but will fight aggressively when cornered.",    
    "headShape": "round",
    "bodyShape": "slender",    
    "tailShape": "long",
    "baseColor": "black",
    "markings": false,    
    "markColor": "",
    "markShape": "",
    "scaleTexture": "smooth",
    "secondaryColor": "gray"
  },
  "snake4": {
    "commonName": "Black Speckled Kingsnake",
    "scientificName": "Lampropeltis nigra(Stejneger)",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/blackSpeckledKingsnake.jpg",
    "venomous": false,
    "diet": "rodents, birds, lizards, other snakes, eggs",
    "size": "66 in",    
    "conservationStatus": "High concern",
    "description": "Speckled kingsnakes are active from spring through late fall. During these times, these kingsnakes are primarily active during the day but as temperatures increase in summer they are active at dusk and at night. They occur in nearly all habitats, from riparian forests to open prairie. Mating occurs from March through May, and females likely deposit eggs in late May and June. Hatchlings appear in August and September. Number of eggs varies from about six in small females to at least 23 in large females. Although speckled kingsnakes are often referred to as “cannibalistic,” they typically do not eat other speckled kingsnakes. These snakes are best known for their ability to eat large snakes, including venomous species such as western massasaugas and prairie rattlesnakes. A speckled kingsnake can eat snakes as long or longer than they are. Speckled kingsnakes are harmless to humans.",    
    "headShape": "round",
    "bodyShape": "medium",    
    "tailShape": "short",
    "baseColor": "black",
    "markings": true,    
    "markColor": "white, yellow",
    "markShape": "speckles",
    "scaleTexture": "smooth",
    "secondaryColor": "white, yellow"
  },
  "snake5": {
    "commonName": "Broad Banded Water Snake",
    "scientificName": "Nerodia fasciata",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/broadBandedWaterSnake.jpg",
    "venomous": false,
    "diet": "fish, tadpoles, frogs, toads, crayfish",
    "size": "36 in",    
    "conservationStatus": "High concern",
    "description": "Broad-banded Watersnakes have noticeably wide, dark brown, crossbands along a reddish colored body.  The belly is yellow with square spots on each ventral scale.  They also have a dark brown stripe extending from behind the eye unto the neck. They have keeled scales and a divided anal plate.",    
    "headShape": "arrow",
    "bodyShape": "stocky",    
    "tailShape": "short",
    "baseColor": "black",
    "markings": true,    
    "markColor": "cream, orange",
    "markShape": "bands",
    "scaleTexture": "rough",
    "secondaryColor": "tan"
  },
  "snake6": {
    "commonName": "Brown Snake",
    "scientificName": "Storeria dekayi ssp.",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/brownSnake.jpg",
    "venomous": false,
    "diet": "slugs, earthworms, snails, salamanders, grubs",
    "size": "6-13 in",    
    "conservationStatus": "least concern",
    "description": "Brown snakes are found throughout the eastern US, but are absent from high elevations in the mountains. In extreme southern Georgia and Florida, brown snakes are replaced by the closely-related Florida brown snake (Storeria victa). In the Piedmont this species can be found in a variety of woodland habitats. In the Coastal Plain this species is most common in wet areas such as cypress swamp edges and wetland margins. Brown snakes are frequently found in residential areas, and are often the most abundant snake in urbanized habitats. This lends to their reputation of being a “city snake.” This snake can be found under debris in residential areas and almost anywhere else where there is groundcover.",    
    "headShape": "round",
    "bodyShape": "medium",    
    "tailShape": "long",
    "baseColor": "brown",
    "markings": true,    
    "markColor": "brown",
    "markShape": "spots, dorsal stripe",
    "scaleTexture": "smooth",
    "secondaryColor": "tan"
  },
  "snake7": {
    "commonName": "Brown Water Snake",
    "scientificName": "Nerodia taxispilota",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/brownWaterSnake.jpg",
    "venomous": false,
    "diet": "fish, other snakes, frogs, catfish",
    "size": "30-55 in",    
    "conservationStatus": "low concern",
    "description": "Brown water snakes are predaceous carnivores. They play an important role in regulating populations of their prey and help to maintain a balance in their environment. They are excellent climbers and can be found 20 feet or more above the ground in trees. Often, they will lie or bask, on rocks. This warms their bodies in the sunlight and increases their metabolic activity. If startled, they will leap into the water or occasionally (and accidentally) into a boat. They are excellent swimmers, and may stay submerged for long periods of time. If cornered they sometimes flatten their necks and strike viciously. They often release a foul-smelling musk when threatened or handled. They are active both during the day and during the night. During the hottest portion of the year they tend to become more nocturnal (active a night).",    
    "headShape": "arrow",
    "bodyShape": "medium",    
    "tailShape": "long",
    "baseColor": "tan",
    "markings": true,    
    "markColor": "brown",
    "markShape": "blotches",
    "scaleTexture": "rough",
    "secondaryColor": "brown"
  },
  "snake8": {
    "commonName": "Butler's Garter Snake",
    "scientificName": "Nerodia taxispilota",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/butlersGarterSnake.jpg",
    "venomous": false,
    "diet": "earthworms, leeches, salamanders, frogs",
    "size": "15-20 in",    
    "conservationStatus": "low concern",
    "description": "Butler's garter snakes inhabit moist, grassy, open canopy areas, such as meadows, wet prairies, marshes, savannas and grasslands. Like Kirtland's snake, they may also be found in grassy vacant lots in suburban and residential areas. The species can often be found under rocks, logs, trash, and boards. The species hibernates communally, often with other garter snake species. Butler's garter snakes are a relatively short-lived species, and they reach sexual maturity in their second spring.",    
    "headShape": "round",
    "bodyShape": "slender",    
    "tailShape": "long",
    "baseColor": "brown, black",
    "markings": true,    
    "markColor": "yellow",
    "markShape": "stripes",
    "scaleTexture": "smooth",
    "secondaryColor": "cream"
  },
  "snake9": {
    "commonName": "Coachwhip Snake",
    "scientificName": "Masticophis flagellum",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/coachwhipSnake.jpg",
    "venomous": false,
    "diet": "insects, amphibians, lizards, snakes, birds, rodents",
    "size": "96 in",    
    "conservationStatus": "low concern",
    "description": "Coachwhip coloration is very distinctive, fading gradually from black on the head to tan or nearly white on the tail. The proportion of black to tan varies across our region and individuals in southern Georgia and Florida can be nearly completely tan. The pattern of scales on the tail resembles a braided whip, giving the snake its common name. Young coachwhips are very slender and completely tan with irregular darker bands and white markings on the head and neck. Coachwhips have large eyes and excellent vision.",    
    "headShape": "arrow",
    "bodyShape": "slender",    
    "tailShape": "long",
    "baseColor": "black",
    "markings": false,    
    "markColor": "",
    "markShape": "",
    "scaleTexture": "smooth",
    "secondaryColor": "brown"
  },
  "snake10": {
    "commonName": "Common Garter Snake",
    "scientificName": "Thamnophis sirtalis",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/commonGarterSnake.jpg",
    "venomous": false,
    "diet": "earthworms, amphibians, leeches, slugs, snails, insects, crayfish, small fish, other snakes, small mammals",
    "size": "18-54 in",    
    "conservationStatus": "least concern",
    "description": "Common garter snakes are highly variable in color pattern. They typically have three light stripes that run along the length of their body on a black, brown, gray, or olive background. The stripes can be white, yellow, blue, greenish, or brown. One stripe runs down the center of the snake's back, the other two stripes run alongside this central stripe. Sometimes the stripes are absent or poorly defined. Some garter snakes have alternating rows of dark spots that run along the stripes, making the stripes look more like checkerboard patterns of light, rather than lines. Common garter snakes have a head that is wider than the neck and is uniformly dark. Their tongues are red, tipped in black, and their scales are keeled (with a raised ridge along the length of the scale). The chin, throat and belly resemble the stripes in coloration, ranging from white to yellow, greenish, blue, or brown.",    
    "headShape": "round",
    "bodyShape": "medium",    
    "tailShape": "long",
    "baseColor": "black",
    "markings": true,    
    "markColor": "yellow",
    "markShape": "stripes",
    "scaleTexture": "smooth",
    "secondaryColor": "red"
  },
  "snake12": {
    "commonName": "Common Water Snake",
    "scientificName": "Nerodia sipedon",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/commonWaterSnake.jpg",
    "venomous": false,
    "diet": "amphibians, fish, crayfish, large insects, leeches, other snakes, turtles, birds, small mammals",
    "size": "36-42 in",    
    "conservationStatus": "high concern",
    "description": "When young, the Common Watersnake has reddish-brown blotches on a cream background. They darken with age to almost solid black or brown with dark brown blotches. They have dark vertical stripes on their lips. Their underside is glossy smooth and beautifully marked with red crescents on a white or yellow background. Watersnakes are thick-bodied snakes with heavily keeled scales. Adults are usually 3-4 feet long (the longest documented in Vermont is 52 inches).  If caught and handled this snake is likely to defend itself but they are not aggressive if left alone.  They are curious though, and this behavior is often misunderstood and unnecessarily feared.",    
    "headShape": "round",
    "bodyShape": "stocky",    
    "tailShape": "long",
    "baseColor": "brown",
    "markings": true,    
    "markColor": "dark brown",
    "markShape": "bands",
    "scaleTexture": "rough",
    "secondaryColor": "dark brown"
  },
  "snake13": {
    "commonName": "Copperhead",
    "scientificName": "Agkistrodon contortrix",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/copperHead.jpg",
    "venomous": true,
    "diet": "small mammals, lizards, frogs, toads, insects, small birds, salamanders",
    "size": "20-40 in",    
    "conservationStatus": "least concern",
    "description": "Copperheads are heavy bodied venomous snakes in the pit-viper family. They have tan-brown bodies with dark brown hourglass shapes lining the length of the body. The hourglass shapes are narrower toward the top of the back and get wider as they go down toward the stomach. These make them highly camouflaged in forested areas, especially with abundant leaf litter. There are pit glands in the head between the eye and nostril that sense heat and help identify prey and predators. Their eyes blend in well with the color of their skin and they have dark black vertical pupils (cat eyes).  Juveniles resemble adults but have yellow tails.",    
    "headShape": "arrow",
    "bodyShape": "stocky",    
    "tailShape": "short",
    "baseColor": "tan",
    "markings": true,    
    "markColor": "brown",
    "markShape": "saddles",
    "scaleTexture": "rough",
    "secondaryColor": "brown"
  },
  "snake14": {
    "commonName": "Cottonmouth",
    "scientificName": "Agkistrodon contortrix",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/cottonMouth.jpg",
    "venomous": true,
    "diet": "amphibians, fish, crayfish, large insects, baby alligators, other snakes, turtles, birds, small mammals",
    "size": "30-48 in",    
    "conservationStatus": "least concern",
    "description": "Cottonmouth are large, aquatic, venomous snakes.   They are generally dark above – olive, brown, or black.  A lighter to darker cross-banding pattern may be seen, especially on the sides.  Juveniles are brightly-colored with reddish-brown cross-bands and have a sulfur-colored tail.  The reddish-brown cross-bands contain many dark spots and speckles but darken with age so adults retain only a hint of the former banding or are a uniform black.  The scales are keeled.  The eye is camouflaged by a broad, dark, facial strip.  The head is thick and distinctly broader than the neck and, when viewed from above, the eyes cannot be seen.  large plate like scales cover the top of the head and in front of the eyes.  Eye pupils are vertical.  There are pit-like depressions between the nostrils and the eyes.  Anal plate is single and scales under the tail are in single rows.  Cottonmouths vibrate their tails when excited.  A thoroughly aroused cottonmouth throws its head upward and backward and holds its mouth wide open, revealing a white interior – the origin of the name cottonmouth.",    
    "headShape": "arrow",
    "bodyShape": "stocky",    
    "tailShape": "short",
    "baseColor": "brown",
    "markings": true,    
    "markColor": "dark brown",
    "markShape": "bands",
    "scaleTexture": "rough",
    "secondaryColor": "black"
  },
  "snake15": {
    "commonName": "Dekay's Brown Snake",
    "scientificName": "Storeria d. dekayi",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/dekaysBrownSnake.jpg",
    "venomous": false,
    "diet": "insects, earthworms, tree frogs",
    "size": "9-15 in",    
    "conservationStatus": "least concern",
    "description": "Dekay's brownsnakes are secretive, preferring to stay under cover. They are out in the day, but will become nocturnal in very warm weather. They are a somewhat cold-tolerant species and begin hibernation in October or November. They can emerge in March or April. They den in burrows, rock crevices or under buildings, below the frost line. They often den communally and share winter dens with other brownsnakes and with other snake species such as garter snakes, redbelly snakes and smooth greensnakes.",    
    "headShape": "round",
    "bodyShape": "medium",    
    "tailShape": "long",
    "baseColor": "tan",
    "markings": true,    
    "markColor": "brown",
    "markShape": "spots, dorsal stripe",
    "scaleTexture": "rough",
    "secondaryColor": "gray"
  },
  "snake16": {
    "commonName": "Diamondback Water Snake",
    "scientificName": "Nerodia rhombifer",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/diamondbackWaterSnake.jpg",
    "venomous": false,
    "diet": "amphibians, fish",
    "size": "30-48 in",    
    "conservationStatus": "least concern",
    "description": "The diamondback water snake is predominantly brown, dark brown, or dark olive green in color, with a black net-like pattern along the back, with each spot being vaguely diamond-shaped. Dark vertical bars and lighter coloring are often present down the sides of the snake. In typical counter-colored fashion, the underside is generally a yellow or lighter brown color, often with black blotching. The dorsal scales are heavily keeled, giving the snake a rough texture. Adult males have multiple papillae (tubercles) on the under surface of the chin, which are not found on any other species of snake in the United States.",    
    "headShape": "arrow",
    "bodyShape": "stocky",    
    "tailShape": "short",
    "baseColor": "brown",
    "markings": true,    
    "markColor": "black",
    "markShape": "saddles",
    "scaleTexture": "rough",
    "secondaryColor": "olive"
  },
  "snake17": {
    "commonName": "Eastern Black Kingsnake",
    "scientificName": "Lampropeltis nigra",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/easternBlackKingsnake.jpg",
    "venomous": false,
    "diet": "other snakes, amphibians, eggs, lizards, small mammals",
    "size": "48 in",    
    "conservationStatus": "least concern",
    "description": "This species is mostly black on the back, lacking the chainlike pattern of white to yellow that is found in the eastern kingsnake (Lampropeltis getula). However, young individuals of this species may display a faint pattern on the back. The belly may have yellowish spots or irregular patches and is darker posteriorly. Kingsnakes are noted for vibrating their tails when disturbed and for discharging musk from glands at the base of the tail when picked up. These snakes are immune to snake venom and will consume venomous snakes when given an opportunity. They are preyed upon by raccoons, opossums, skunks and other kingsnakes.",    
    "headShape": "round",
    "bodyShape": "medium",    
    "tailShape": "long",
    "baseColor": "black",
    "markings": true,    
    "markColor": "yellow",
    "markShape": "speckles",
    "scaleTexture": "smooth",
    "secondaryColor": "yellow"
  },
  "snake18": {
    "commonName": "Eastern Coachwhip",
    "scientificName": "Masticophis flagellum flagellum",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/easternCoachwhip.jpg",
    "venomous": false,
    "diet": "birds, large insects, lizards, other snakes, small mammals",
    "size": "50-72 in",    
    "conservationStatus": "least concern",
    "description": "Eastern Coachwhip are among North America's largest native snakes. The head and neck are usually black, fading to tan posteriorly. Some specimens may lack the dark head and neck pigmentation. Their smooth scales and coloration give the appearance of a braided whip, hence the common name.",    
    "headShape": "round",
    "bodyShape": "slender",    
    "tailShape": "long",
    "baseColor": "tan",
    "markings": false,    
    "markColor": "",
    "markShape": "",
    "scaleTexture": "smooth",
    "secondaryColor": "brown"
  },
  "snake19": {
    "commonName": "Eastern Coral Snake",
    "scientificName": "Micrurus fulvius",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/easternCoralSnake.jpg",
    "venomous": true,
    "diet": "snakes, lizards",
    "size": "18-30 in",    
    "conservationStatus": "least concern",
    "description": "Coral snakes are rarely seen in most areas where they occur, probably because they are highly secretive and spend most of their time underground. They typically do not climb trees or shrubs and spend only limited time crawling above ground. Most sightings of coral snakes are in the spring and fall. When threatened, coral snakes often elevate and curl the tip of their tail. They are noted for preying primarily on other snakes and lizards, which they kill by injecting with venom. Eastern coral snakes lay an average of six or seven eggs in early summer and the young hatch in late summer or early fall. Perhaps because of their secretive habits, coral snakes often persist is suburban areas.",    
    "headShape": "round",
    "bodyShape": "slender",    
    "tailShape": "long",
    "baseColor": "black",
    "markings": true,    
    "markColor": "red, yellow",
    "markShape": "bands",
    "scaleTexture": "smooth",
    "secondaryColor": "red"
  },
  "snake20": {
    "commonName": "Eastern Diamondback Rattlesnake",
    "scientificName": "Crotalus adamanteus",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/easternDiamondbackRattleSnake.jpg",
    "venomous": true,
    "diet": "snakes, lizards",
    "size": "48-60 in",    
    "conservationStatus": "high concern",
    "description": "The eastern diamondback rattlesnake is the largest species of rattlesnake in the world.  The tail is short and stout with a rattle or button at the end.  The rattle is composed of hollow, interlocking segments that click against each other when the tail vibrates.  The topside of the snake contains the characteristic yellow diamond shapes surrounding black and brown centers.  The belly is generally yellowish to white.  The large and distinctive head is marked with a dark band extending obliquely from each eye to the lips.  The band is bordered on each side by a light streak.  A heat sensitive “pit” is located on each side of the head between the eye and nostril.  The upper jaw contains movable recurved fangs.  When encountered, the diamondback will often remain motionless until a threat is perceived or the snake is actually touched.  A defensive posture is a coiled position with rattle erect, buzzing, and head near center of the coil.  The act of striking can extend up to two-thirds the length of the snake.",    
    "headShape": "arrow",
    "bodyShape": "stocky",    
    "tailShape": "rattle",
    "baseColor": "brown",
    "markings": true,    
    "markColor": "black, brown",
    "markShape": "diamond",
    "scaleTexture": "rough",
    "secondaryColor": "yellow"
  },
  "snake21": {
    "commonName": "Eastern Foxsnake",
    "scientificName": "Pantherophis gloydi",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/easternFoxsnake.jpg",
    "venomous": false,
    "diet": "small mammals, frogs, birds, eggs",
    "size": "36-66 in",    
    "conservationStatus": "threatened",
    "description": "The Eastern Fox Snake has large dark brown or black blotches down the middle of the back and smaller, alternating blotches along the sides of a yellowish to light brown body. The underside is yellowish checkered with dark squarish spots. The head can be yellow, light brown to reddish brown and is generally unmarked except for a dark band between the eyes on the top of the head and a few dark bands extending from the eye down to the mouth. Juvenile Eastern Fox Snakes are paler in color than the adults and have gray or brown blotches bordered in black on the back and more distinctive head markings.",    
    "headShape": "round",
    "bodyShape": "medium",    
    "tailShape": "long",
    "baseColor": "tan",
    "markings": true,    
    "markColor": "brown",
    "markShape": "spots",
    "scaleTexture": "smooth",
    "secondaryColor": "yellow"
  },
  "snake22": {
    "commonName": "Eastern Garter Snake",
    "scientificName": "Thamnophis sirtalis sirtalis",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/easternGarterSnake.jpg",
    "venomous": false,
    "diet": "toads, frogs, slugs, worms",
    "size": "18-26 in",    
    "conservationStatus": "low concern",
    "description": "The eastern garter snake has a wide range across eastern North America, going as far north as southern Ontario and Quebec to the Gulf of Mexico in the south, along the eastern shores of America to the Mississippi River. Eastern garter snakes like to conceal themselves under logs, stones and other debris that allow them to bask in the sunlight and quickly seek refuge from predators.",    
    "headShape": "round",
    "bodyShape": "medium",    
    "tailShape": "long",
    "baseColor": "brown",
    "markings": true,    
    "markColor": "yellow",
    "markShape": "lateral stripes",
    "scaleTexture": "smooth",
    "secondaryColor": "black"
  },
  "snake23": {
    "commonName": "Eastern Hognose Snake",
    "scientificName": "Heterodon platirhinos",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/easternHognoseSnake.jpg",
    "venomous": false,
    "diet": "amphibians, toads, frogs",
    "size": "28 in",    
    "conservationStatus": "low concern",
    "description": "The most distinguishing feature of the Eastern Hognose is the upturned snout, used for digging in sandy soils. The color pattern is extremely variable. It can be red, green, orange, brown, gray to black, or any combination thereof depending on locality. They can be blotched, checkered, or patternless. The belly tends to be a solid gray, yellow, or cream-colored. In this species the underside of the tail is lighter than the belly. Although Hognose are rear-fanged, they are often considered nonvenomous because they are not harmful to humans. Heterodon means 'different tooth', which refers to the enlarged teeth at the rear of the upper jaw. These teeth inject a mild amphibian-specific venom into prey, and also are used to 'pop' inflated toads like a balloon to enable swallowing. Bitten humans who are allergic to the saliva have been known to experience local swelling, but no human deaths have been documented.",    
    "headShape": "arrow",
    "bodyShape": "stocky",    
    "tailShape": "short",
    "baseColor": "brown",
    "markings": true,    
    "markColor": "tan",
    "markShape": "spots",
    "scaleTexture": "rough",
    "secondaryColor": "black, tan"
  },
  "snake24": {
    "commonName": "Eastern Indigo Snake",
    "scientificName": "Drymarchon corais couperi",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/easternIndigoSnake.jpg",
    "venomous": false,
    "diet": "snakes, turtles, lizards, frogs, toads, birds, eggs, small mammals",
    "size": "72-84 in",    
    "conservationStatus": "threatened",
    "description": "The Eastern Indigo Snake is a large nonvenomous, stout bodied snake averaging six to seven feet in length.  The largest individual recorded was eight-and-a-half-feet.  The Indigo Snake is smooth scaled and uniform glossy blue-black throughout its body except for some reddish orange or cream color suffusion on its throat, cheeks and chin.  This coloration varies with some individuals having distinct coloration and others with no coloration. Smaller indigo snakes are easily mistaken for the common black racer.  Close examination is required to tell them apart. The common black racer is a slender, fast moving snake. The indigo snake is a stout, slow-moving snake.  A distinct difference between the indigo snake and the black racer is the anal plate which is entire on the indigo and divided on the black racer.  Another snake that is sometimes mistaken for the indigo snake is the black pine snake.  Black pine snakes inhabit some of the same geographic locations as the indigo, but are easily differentiated.  Black pine snakes have keeled scales while the indigo snake has smooth scales.",    
    "headShape": "arrow",
    "bodyShape": "medium",    
    "tailShape": "long",
    "baseColor": "black",
    "markings": false,    
    "markColor": "",
    "markShape": "",
    "scaleTexture": "smooth",
    "secondaryColor": "red, cream"
  },
  "snake25": {
    "commonName": "Eastern Massasauga",
    "scientificName": "Sistrurus catenatus catenatus",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/easternMassasagua.jpg",
    "venomous": true,
    "diet": "small mammals, other snakes, birds, frogs",
    "size": "24-36 in",    
    "conservationStatus": "endangered",
    "description": "The eastern massasauga is primarily associated with wetland habitats but some populations also utilize adjacent upland habitats for parts of its life history. Although it's venomous, the massasauga is a timid snake. It prefers to avoid detection by hiding under vegetation, woody debris or other cover or remaining motionless and relying on its cryptic coloration. When it is disturbed or encountered in open habitat, the massasauga prefers to move to a more hidden location. The massasauga also appears to have strong site fidelity, often returning to the same hibernation site or area each year. Studies to date also have found that massasaugas were not be able to survive the winter when moved to a new area outside their home range presumably because they were not able to find suitable hibernation sites.",    
    "headShape": "round",
    "bodyShape": "stocky",    
    "tailShape": "rattle",
    "baseColor": "gray",
    "markings": true,    
    "markColor": "black",
    "markShape": "spots",
    "scaleTexture": "rough",
    "secondaryColor": "brown"
  },
  "snake26": {
    "commonName": "Eastern Milk Snake",
    "scientificName": "Lampropeltis triangulum triangulum",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/easternMilksnake.jpg",
    "venomous": false,
    "diet": "small mammals, other snakes, birds, frogs",
    "size": "24-36 in",    
    "conservationStatus": "low concern",
    "description": "The Eastern milksnake is not venomous and poses no significant threat to humans, its teeth barely able to pierce human skin. The Eastern milksnake can be found in woods, meadows, river bottoms, farms and even cities. The milksnake gets its name from the myth that, at night, they enter barns and 'suck' milk from cows. This is because they are often found in barns hunting rodents. However, they do not have the ability to 'suck' milk or anything else.",    
    "headShape": "round",
    "bodyShape": "slender",    
    "tailShape": "long",
    "baseColor": "cream, gray",
    "markings": true,    
    "markColor": "red, brown",
    "markShape": "saddles",
    "scaleTexture": "smooth",
    "secondaryColor": "black"
  },
  "snake27": {
    "commonName": "Eastern Ribbon Snake",
    "scientificName": "Thamnophis sauritus sauritus",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/easternRibbonsnake.jpg",
    "venomous": false,
    "diet": "amphibians, frogs, insects, fish",
    "size": "16-28 in",    
    "conservationStatus": "low concern",
    "description": "Ribbon snakes resemble the closely related eastern garter snake Thamnophis sirtalis sirtalis and may be easily confused with it.  The ribbon snake generally has a more slender profile and will have a shorter tail than the garter snake.  On the ribbon snake, the lateral stripes that extend down the sides are located on the third and fourth scale row.  Garter snakes side stripes are located on the second and third scale rows.  The vertebral stripe is always present on the ribbon snake, but may be absent on the garter snake.",    
    "headShape": "round",
    "bodyShape": "slender",    
    "tailShape": "long",
    "baseColor": "black",
    "markings": true,    
    "markColor": "yellow",
    "markShape": "lateral stripes",
    "scaleTexture": "rough",
    "secondaryColor": "brown"
  },
  "snake28": {
    "commonName": "Eastern Smooth Earth Snake",
    "scientificName": "Virginia valeriae valeriae",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/easternSmoothEarthSnake.jpg",
    "venomous": false,
    "diet": "insects, larvae, earthworms",
    "size": "7-12 in",    
    "conservationStatus": "low concern",
    "description": "The Earth Snakes are highly secretive and seldom seen. Heavy rains will sometimes bring them above ground, but even then they often stay hidden under rocks. Most of the time they remain below ground where they find their food. The soil-like color of these snakes also helps to keep them from being noticed by people. One author reports that the Earth Snakes are common in local areas, and further supposes that they may be more abundant than it seems. Eastern Smooth Earth Snakes sometimes congregate in small numbers as the weather grows colder in autumn. They hibernate under large rocks or in accumulations of woodland debris. They often hibernate with other small snakes such as Ring-necked Snakes and Worm Snakes.",    
    "headShape": "round",
    "bodyShape": "slender",    
    "tailShape": "long",
    "baseColor": "brown",
    "markings": true,    
    "markColor": "black",
    "markShape": "speckles",
    "scaleTexture": "smooth",
    "secondaryColor": "gray"
  },
  "snake29": {
    "commonName": "Eastern Worm Snake",
    "scientificName": "Carphophis amoenus amoenus",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/easternWormSnake.jpg",
    "venomous": false,
    "diet": "insects, larvae, earthworms",
    "size": "7-11 in",    
    "conservationStatus": "threatened",
    "description": "Worm snakes are fossorial in nature, in other words, they spend most of their life underground. They will also burrow into rotting logs and stumps, and can often be found under rocks. Worm snakes prefer damp forested soils with abundant leaf litter. However they can be found anywhere earthworms are found including fields and backyards.",    
    "headShape": "round",
    "bodyShape": "slender",    
    "tailShape": "short",
    "baseColor": "brown",
    "markings": false,    
    "markColor": "",
    "markShape": "",
    "scaleTexture": "smooth",
    "secondaryColor": "pink"
  },
  "snake30": {
    "commonName": "Flathead Snake",
    "scientificName": "Tantilla gracilis",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/flatheadSnake.jpg",
    "venomous": false,
    "diet": "insects, larvae, earthworms, centipedes",
    "size": "7-8 in",    
    "conservationStatus": "low concern",
    "description": "Normally active from April through October, this us a burrowing species. It spends most of its time in slightly moist soil under rocks or in underground burrows. South-facing, rocky, wooded hillsides, especially where sandy soil occurs with limestone rock, are its preferred habitats. This species is not known to bite when captured. In hot weather and during winter, these snakes burrow underground.",
    "headShape": "round",
    "bodyShape": "slender",    
    "tailShape": "short",
    "baseColor": "brown",
    "markings": true,    
    "markColor": "black",
    "markShape": "cap",
    "scaleTexture": "smooth",
    "secondaryColor": "pink"
  },
  "snake31": {
    "commonName": "Florida Green Water Snake",
    "scientificName": "Nerodia floridana",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/floridaGreenWaterSnake.jpeg",
    "venomous": false,
    "diet": "fish, frogs",
    "size": "30-55 in",    
    "conservationStatus": "low concern",
    "description": "This is a large and bulky animal, reaching lengths of over six feet. The patterning is relatively non-descript and the snake generally appears to be a uniform dark or dull green with the color becoming lighter on the snake’s sides.  Dark bands may be visible on both the snake’s back and sides, particularly in younger snakes. This species is often mistaken for the cottonmouth, but the venomous pit viper has boxy and triangular shaped head. Scales are keeled.", 
    "headShape": "round",
    "bodyShape": "stocky",    
    "tailShape": "long",
    "baseColor": "brown",
    "markings": true,    
    "markColor": "black",
    "markShape": "checkers",
    "scaleTexture": "rough",
    "secondaryColor": "cream"
  },
  "snake32": {
    "commonName": "Florida Pine Snake",
    "scientificName": "Pituophis melanoleucus mugitus",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/floridaPineSnake.jpg",
    "venomous": false,
    "diet": "pocket gophers, small mammals, birds",
    "size": "46-66 in",    
    "conservationStatus": "threatened",
    "description": "Dorsal color pattern of alternating dark rusty brown and cream-colored blotches often indistinct anteriorly, becoming distinct posteriorly; each scale trimmed in dark brown pigment. Individuals may vary from light gray anteriorly to rusty-brown posteriorly. Body moderately stout, but head only slightly wider than neck. A key character is the markedly pointed snout with an enlarged rostral scale for pushing into soft earth. Belly immaculate white, but darker dorsal blotches may color the sides of the ventral scales. Often makes a startlingly loud hissing sound when cornered and frightened.",    
    "headShape": "round",
    "bodyShape": "slender",    
    "tailShape": "long",
    "baseColor": "cream",
    "markings": true,    
    "markColor": "brown",
    "markShape": "blotches",
    "scaleTexture": "smooth",
    "secondaryColor": "tan"
  },
  "snake33": {
    "commonName": "Glossy Crayfish Snake",
    "scientificName": "Regina rigida sinicola",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/glossyCrayfishSnake.jpg",
    "venomous": false,
    "diet": "crayfish",
    "size": "14-24 in",    
    "conservationStatus": "low concern",
    "description": "A small and slender snake. The back is typically olive green although it may appear almost yellow close to the belly. A couple narrow stripes may be seen running down the length of the body. The belly is light colored with two rows of dark spots that unite to become one as they approach the animal’s throat. Highly aquatic, glossy crayfish snakes can be observed in many different wetland types but may be most often encountered in areas with a high density of aquatic vegetation and mucky substrates.",    
    "headShape": "round",
    "bodyShape": "slender",    
    "tailShape": "long",
    "baseColor": "olive",
    "markings": false,    
    "markColor": "",
    "markShape": "",
    "scaleTexture": "smooth",
    "secondaryColor": "yellow"
  },
  "snake34": {
    "commonName": "Gopher Snake",
    "scientificName": "Pituophis catenifer",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/gopherSnake.jpg",
    "venomous": false,
    "diet": "gophers, small mammals, lizards, snakes, frogs, eggs",
    "size": "36-84 in",    
    "conservationStatus": "special concern",
    "description": "Dorsally, they are yellowish or pale brown, with a series of large, dark brown or black blotches, and smaller, dark spots on the sides. Ventrally, they are yellowish, either uniform or with brown markings. The gopher snake has an odd defensive mechanism, in which it puffs up its body and curls itself into the classic strike pose of a pit viper. However, rather than delivering an open-mouthed strike, the gopher snake is known for striking with a closed mouth, using its blunt nose to warn off possible predators. Also, it often shakes its tail, confusing predators into thinking it is a rattlesnake. This works best when the snake is in dry leaves or on gravel. It usually hunts its prey on land, but occasionally ventures out into ponds to hunt frogs.",    
    "headShape": "arrow",
    "bodyShape": "medium",    
    "tailShape": "long",
    "baseColor": "yellow",
    "markings": true,    
    "markColor": "brown, black",
    "markShape": "blotches",
    "scaleTexture": "rough",
    "secondaryColor": "tan"
  },
  "snake35": {
    "commonName": "Graham's Crayfish Snake",
    "scientificName": "Regina grahamii",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/grahmsCrayfishSnake.jpg",
    "venomous": false,
    "diet": "crayfish, fish",
    "size": "18-28 in",    
    "conservationStatus": "low concern",
    "description": "Graham's crayfish snake is a medium-sized, dull-colored, semiaquatic snake known from prairie streams, marshes, and ponds. The ground color is brown or yellowish brown above, with yellowish-tan stripes along the sides. There may be a faint tan stripe along the middle of the back. The belly is cream colored or light yellow, with a faint central row of gray or light brown dots and a zigzag pattern of dark brown along both edges. If captured, these snakes generally do not bite but usually release a foul-smelling musk mixed with feces.",    
    "headShape": "round",
    "bodyShape": "medium",    
    "tailShape": "long",
    "baseColor": "brown",
    "markings": true,    
    "markColor": "tan",
    "markShape": "lateral stripes",
    "scaleTexture": "rough",
    "secondaryColor": "tan"
  },
  "snake36": {
    "commonName": "Gray Ratsnake",
    "scientificName": "Pantherophis spiloides",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/grayRatSnake.jpg",
    "venomous": false,
    "diet": "small mammals, birds, eggs, frogs, lizards",
    "size": "99-183 in",    
    "conservationStatus": "low concern",
    "description": "The gray rat snake has a gray background color with brown to dark gray blotches.  Belly is white with boxlike dark gray to brownish blotches and dark spots that become stripes under the tail. When startled, the gray ratsnake, like other ratsnakes, stops and remains motionless with its body held in a series of wave-like kinks. The snake will also rattle its tail against whatever it is lying on, making an audible buzzing sound. The gray ratsnake will defend itself by raising its head and bluffing a strike. If handled, it will musk a victim by releasing the foul-smelling contents of its cloaca, and will bite if necessary. However, the gray ratsnake is less likely to bite than other members of its genus, and wounds from a bite rarely require more than a small bandage.",    
    "headShape": "round",
    "bodyShape": "slender",    
    "tailShape": "long",
    "baseColor": "gray",
    "markings": true,    
    "markColor": "brown, dark gray",
    "markShape": "blotches",
    "scaleTexture": "smooth",
    "secondaryColor": "black"
  },
  "snake37": {
    "commonName": "Kingsnake",
    "scientificName": "Lampropeltis getula",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/kingsnake.jpg",
    "venomous": false,
    "diet": "small mammals, birds, eggs, frogs, lizards",
    "size": "99-122 in",    
    "conservationStatus": "high concern",
    "description": "The kingsnake is comprised of eight species, including the common kingsnake. The kingsnake has the largest natural geographical range of any land snake. It occupies an array of habitats from southern Canada to northern South America. The common kingsnake, with a number of subspecies, occurs across the United States and northern and central Mexico, from the Pacific coast to the Atlantic coast to the Gulf coast. Exceptionally adaptable for a reptile, the common kingsnake makes itself at home in a diversity of habitats, ranging from desert basins to riverine wetlands, from valleys to rolling hills, from coastal estuaries to grasslands, from shrublands to forested mountain foothills. Secretive, they often seclude themselves in dense vegetation, under rocks and beneath fallen logs and inside rodent burrows. They usually keep to the ground's surface, but they can climb swiftly into brush or swim efficiently in ponds and quiet streams.",    
    "headShape": "round",
    "bodyShape": "slender",    
    "tailShape": "long",
    "baseColor": "black",
    "markings": true,    
    "markColor": "white",
    "markShape": "chain",
    "scaleTexture": "smooth",
    "secondaryColor": "yellow"
  },
  "snake38": {
    "commonName": "Kirtland's Snake",
    "scientificName": "Clonophis kirtlandii",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/kirtlandsSnake.jpg",
    "venomous": false,
    "diet": "crayfish, earthworms, slugs, minnows, salamanders, frogs, toads",
    "size": "12-18 in",    
    "conservationStatus": "threatened",
    "description": "The Kirtland's Snake is grayish brown with a double series of large black spots down the back, and alternating smaller spots running down each side. The ventral scales are brick red with a prominent round black spot at each outer end. It has 19 rows of keeled dorsal scales at midbody, and the anal plate is divided. When alarmed a Kirtland's Snake flattens its entire body to a remarkable thinness, and becomes rigid. The Kirtland's snake will also coil up into a disc the size of about a quarter in an attempt to hide from potential threats, if this does not succeed it will then flee, instead of fight.",    
    "headShape": "round",
    "bodyShape": "slender",    
    "tailShape": "long",
    "baseColor": "brown",
    "markings": true,    
    "markColor": "black",
    "markShape": "blotches",
    "scaleTexture": "rough",
    "secondaryColor": "red"
  },
  "snake39": {
    "commonName": "Lined Snake",
    "scientificName": "Tropidoclonion lineatum",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/linedSnake.jpg",
    "venomous": false,
    "diet": "earthworms",
    "size": "14-21 in",    
    "conservationStatus": "special concern",
    "description": "Lined Snake, listed as a Special Concern in Wisconsin, is primarily found in open prairies and sparsely timbered areas featuring soft, moist soils. Lined snakes are semi-fossorial, spending a lot of time under rocks, leaf litter, logs or buried in the soil throughout the day. This nocturnal species can also be found above ground at night searching for earthworms, their preferred food. The lined snake breeds early in the fall. Females will then store sperm during hibernation throughout the winter. In the late summer this ovoviviparous snake will give birth to an average of seven or eight young.",    
    "headShape": "round",
    "bodyShape": "medium",    
    "tailShape": "short",
    "baseColor": "brown",
    "markings": true,    
    "markColor": "yellow",
    "markShape": "lateral stripes",
    "scaleTexture": "rough",
    "secondaryColor": "olive"
  },
  "snake40": {
    "commonName": "Midland Water Snake",
    "scientificName": "Nerodia sipedon pleuralis",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/midlandWaterSnake.jpg",
    "venomous": false,
    "diet": "fish, frogs, tadpoles, salamanders, crayfish, turtles",
    "size": "56-102 in",    
    "conservationStatus": "low concern",
    "description": "This species is generally a light brown or tan with darker brown or even reddish bands. The bands connect on the neck and become a more alternating pattern between the back and the sides from the middle part of the body to the tail. The head has smooth, medium sized scales. The eyes have round pupils. The lower lip is white with brown vertical bars (which is one way to distinguish this species from similar-looking venomous snakes in our range). Its scales are keeled. The belly scales are usually white with red, brown and black blotches. This species can be found in and around lakes, ponds, streams, rivers, and is also common in drainage ditches. It prefers areas with wood debris, rocks, or anywhere else there is plenty of hiding available.",    
    "headShape": "arrow",
    "bodyShape": "stocky",    
    "tailShape": "long",
    "baseColor": "tan",
    "markings": true,    
    "markColor": "brown",
    "markShape": "blotches",
    "scaleTexture": "rough",
    "secondaryColor": "yellow"
  },
  "snake41": {
    "commonName": "Milk Snake",
    "scientificName": "Lampropeltis triangulum",
    "imageUrl": "https://snakelings.s3.us-east-2.amazonaws.com/snakeDataImages/milksnake.jpg",
    "venomous": false,
    "diet": "slugs, insects, crickets, earthworms, lizards, small mammals, birds, eggs, snakes",
    "size": "24-120 in",    
    "conservationStatus": "low concern",
    "description": "Some milk snakes have a striking resemblance to coral snakes, in Batesian mimicry, which likely scares away potential predators. Both milk snakes and coral snakes possess transverse bands of red, black, and yellow. Experts now recognize that common mnemonics that people use to distinguish between the deadly coral snake and the harmless milk snake are not 100% reliable. Some coral snakes do not have the typical banding colors or patterns.",    
    "headShape": "arrow",
    "bodyShape": "stocky",    
    "tailShape": "short",
    "baseColor": "red",
    "markings": true,    
    "markColor": "white, black",
    "markShape": "bands",
    "scaleTexture": "smooth",
    "secondaryColor": "white"
  }
}
